import type { Moment } from './types/data.ts'

export const momentsData: Moment[] = [
  {
    id: '1',
    date: '2022-09-01T21:03:11',
    content: '别跪了，连猫都站起来了。',
    imageUrl: '/static/images/moments/cat.jpg',
  },
  {
    id: '2',
    date: '2022-12-31T15:09:21',
    content: '坚持动态清零 -> 全面放弃动态清零，这算魔幻现实主义吗？',
  },
  {
    id: '3',
    date: '2023-05-19T15:29:31',
    content:
      '新冠后第一次打球，明显感觉体力跟不上，才打两局就喘得厉害，只能下场休息。跟球友聊起这事，大家都有类似经历，不少人体检还查出肺结节。说到底这算不算新冠后遗症？那疫苗打了，到底有啥用？',
  },
  {
    id: '4',
    date: '2023-11-19T08:17:39',
    content: '大西北的丹霞地貌。 \n\n这次旅行真的让我震撼，大自然的鬼斧神工实在是太美了。',
    imageUrl: '/static/images/moments/dimao.jpg',
  },
  {
    id: '5',
    date: '2024-01-12T10:22:08',
    content:
      '最开始来公司的时候，年终奖是年前全发，过年额外多放五天假。\n\n然后发展成年终奖元旦前一部分，过年前一部分，过年额外多放四天假。\n\n现在变成了年终奖第二年四月发，过年额外放三天假。\n\n给我搁这玩等差数列呢。',
  },

  {
    id: '6',
    date: '2024-03-25T09:52:28',
    content:
      '问：程序员干累了怎么办？\n\nA同事：干不动了就换工作。\n\nB同事：离职是唯一出路，直接躺平。\n\nC同事：想想你的房贷、车贷、信用贷 。\n\n角落的D同事神回复：**那就拔出来。**\n\n众人：？？？',
  },
  {
    id: '7',
    date: '2024-05-02T21:20:07',
    content:
      '现在网购逐步从淘宝、京东转到闲鱼了，只有你想不到的，没有找不到的，关键它是真便宜啊。\n\n但是要牢记一点：\n\n**不要贪便宜，一定要找信用分极好且差评很少的的靠谱卖家**',
  },
  {
    id: '8',
    date: '2024-06-17T16:40:08',
    content:
      '可能我真的是天生打工圣体。 \n\n公司发的垃圾笔记本运行个项目等半天，时不时卡住得强制重启，忍了两年后还是自己买了台 MacBook Pro，自费上班第一人，我是 🤡。',
  },
  {
    id: '9',
    date: '2024-07-08T20:49:36',
    content: '又一次把线打断了，受害者依然是老伙计弓11。',
    imageUrl: '/static/images/moments/badminton.jpg',
  },
  {
    id: '10',
    date: '2024-08-03T15:27:26',
    content:
      '手里的天斧99宝石蓝已经打了三年多，当初不到一千入的全新SP版。最近听说这拍子价格飞涨，就挂闲鱼打算出了换把战戟8000。\n\n随手标了1600，没想到不到两小时就被秒拍——这爽快劲让我瞬间意识到标低了。聊了几句才知道买家是个女大学生，省吃俭用蹲了好久，就想给男朋友淘个生日惊喜。看她字里行间掩不住的期待，甚至怕我怀疑她是倒狗单独发了一张她和男朋友一起打球的合影，我也就没再纠结价格，成全了这份心意。\n\n**希望她男朋友别辜负了这么好的女朋友！**',
  },
  {
    id: '11',
    date: '2025-03-28T16:08:26',
    content:
      '《[新冠疫苗之父 杨晓明被判处死刑？](https://cj.sina.com.cn/articles/view/3464714474/ce8358ea001012veg)》',
  },
  {
    id: '12',
    date: '2025-04-30T12:05:30',
    content:
      '最近工作有点心累，每天打开电脑就感觉胸口压着块石头堵得慌。到点下班是不可能的，双休也是不可能的，任务按照排期来更是不可能的，一天一个主意。这种无力感让我又开始疯狂想换工作，半夜睡不着都在刷BOSS和智联。\n\n结果越刷越绝望，现在的大环境是真的卷。你说你要是个稍微大点或者有点名气的公司，要求高也就算了，屁大点的公司最低都要求双一流，关键工资也不高啊。最离谱的是有个20人的初创公司，要求里居然写着"要有改变行业的格局"，月薪开8K？你搁这许愿呢？是梁静茹给的勇气吗？\n\n要不起要不起，我还是继续苟着吧。',
  },
  {
    id: '13',
    date: '2025-05-24T21:35:27',
    content:
      '快到618了，同事们都盘算着趁着活动和国补组装台式机，不得不说现在的配件价格真香，4060ti才2000多，整机组完6k搞定，真是晚买享折扣。\n\n翻看手机相册里21年装机的照片，想起那时候的显卡价格，心在滴血...',
    imageUrl: '/static/images/moments/diypc.jpg',
  },
  {
    id: '14',
    date: '2025-06-17T09:12:39',
    content: '第一次买黄山毛峰，对比龙井的口感更能接受，回味甘甜。',
  },
]
